БИТУправление_медицинским_центром_демо/src/InformationRegisters/DicomWorkLists/DicomWorkLists.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>DicomWorkLists</name>
  <comment>Консоль WorkList</comment>
  <resources>
    <name>AccessionNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Allergies</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>BirthDay</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>CommentsOnScheduledProcedureStep</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>MedicalAlerts</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Modality</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>PatientId</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>PatientName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>PreMedication</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>RequestedContrastAgent</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>RequestedProcedureDescription</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>RequestedProcedureID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>RequestedProcedurePriority</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>RequestingPhysician</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ScheduledPerformingPhysiciansName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ScheduledProcedureStepDescription</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ScheduledProcedureStepID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ScheduledProcedureStepLocation</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ScheduledProcedureStepStartDate</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ScheduledProcedureStepStartTime</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ScheduledStationAETitle</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ScheduledStationName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Sex</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>StudyInstanceUID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ScheduledProcedureStepSequence</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Выполнена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИсследования</name>
    <type>
      <types>EnumRef.СтатусыИсследованийDICOM</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификаторУслуги</name>
    <comment>Уникальный идентификатор услуги</comment>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючСтрокиСоставаУслуги</name>
    <comment>Ключ строки состава услуги</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДобавленоИзMPPS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданФайл</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавленоПоЗапросу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>УникальныйИдентификаторИсследования</name>
    <comment>Уникальный идентификатор исследования</comment>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Прием</name>
    <type>
      <types>DocumentRef.Прием</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/DicomWorkLists/RecordSetModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Интерфейс = DICOMРаботаСДрайверомКлиентСервер.ПолучитьИнтерфейсDICOM();
	Если Интерфейс <> Неопределено Тогда
		Для Каждого Запись Из ЭтотОбъект Цикл
			Запись.RequestedProcedurePriority = "LOW";
			Запись.StudyInstanceUID = Интерфейс.GenerateUniqueIdentifier();
			Запись.УникальныйИдентификаторИсследования = Новый УникальныйИдентификатор;
			#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
			Попытка
				Запись.Ответственный = Пользователи.ТекущийПользователь();
			Исключение
			КонецПопытки;
			#КонецЕсли
			Запись.RequestedProcedureID = Запись.УникальныйИдентификаторИсследования; 
			Запись.ScheduledProcedureStepID = "0";
			Запись.СозданФайл = Истина;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	Для Каждого Запись Из ЭтотОбъект Цикл
		СистемнаяИнформация = Новый СистемнаяИнформация;
		Если СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86_64
			Или СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86
			Тогда
			Запись.ИмяФайла = Запись.ScheduledStationAETitle + "/" + Запись.StudyInstanceUID + ".wl";
		Иначе
			Запись.ИмяФайла = Запись.ScheduledStationAETitle + "\" + Запись.StudyInstanceUID + ".wl";
		КонецЕсли;
		
		Если Запись.Выполнена Или Запись.ДобавленоИзMPPS Тогда
			Запись.СозданФайл = Ложь;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		Данные = Новый Структура;
		Для Каждого Ресурс Из Метаданные.РегистрыСведений.DicomWorkLists.Ресурсы Цикл
			Данные.Вставить(Ресурс.Имя, Запись[Ресурс.Имя]);
		КонецЦикла;
		
		Данные.Вставить("ИмяФайла", Запись.ИмяФайла);
		
		Если Запись.СозданФайл Тогда
			DICOMРаботаСДрайвером.ЗаписатьЭлементWorkList(Данные, Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
